* TODO folder sync [4/4]
  CLOCK: [2017-06-04 Sun 16:45]--[2017-06-04 Sun 17:15] =>  0:30
  :PROPERTIES:
  :Clockhistory: 6
  | :Clock1: | [2017-06-04 Sun 00:43]--[2017-06-04 Sun 02:39] =>  1:56 | callback           |  116 |
  | :Clock2: | [2017-06-04 Sun 02:45]--[2017-06-04 Sun 03:36] =>  0:51 | callback 2         |   51 |
  | :Clock3: | [2017-06-04 Sun 05:56]--[2017-06-04 Sun 06:41] =>  0:45 | lost rate          |   45 |
  | :Clock4: | [2017-06-04 Sun 06:41]--[2017-06-04 Sun 06:57] =>  0:16 | DNS error handling |   16 |
  | :Clock5: | [2017-06-04 Sun 06:57]--[2017-06-04 Sun 08:05] =>  1:08 | CDN for HEAD       |   68 |
  | :Clock6: | [2017-06-04 Sun 16:45]--[2017-06-04 Sun 17:15] =>  0:30 | bandwidth drop     |   30 |
  |          |                                                         |                    | 5.43 |
  #+TBLFM: $4='(convert-time-to-minutes $2)::@7$4=vsum(@1..@6)/60;%.2f
  :END:
  - [X] lmd5 calculation, progress hang
        - blob.sync no callback in async.queue
  - [X] file lost
        - connect timeout crash
          catch
        - /etc/hosts remove all DNS error
        - connection lost
          lsof  -i tcp 2>/dev/null|grep node|grep ESTABLISHED|grep http|awk "{print $2}"|sort|uniq|wc -l
          9794/10547 .92
  - [X] worker die/idle
        - DNS ENOTFOUND error bring down worker
          /etc/hosts can solve it
        - ETIMEDOUT error 
          can be catched
        - blob service reply ECONNRESET on too much HEAD request
          have to use CDN
        - 8 idle and 5 active without dynamic load balance, connection monitor tool
          - process list
            top -p `pgrep -u bazhou -d ',' "node"`
          - active process
            watch -n 1 'lsof  -i tcp 2>/dev/null|grep node|grep ESTABLISHED|grep http|awk "{print $2}"|sort|uniq|wc -l'
          - bandwidth
            sudo iftop
  - [X] performance meter
        - 10k files remote md5 about 3m33s, local md5 about 26s
        - transfer at least 2h, 120m
          176m59.360s 7790/10547
        - connection reduce
          the first 1k download take minutes but last take hours
          reduce to 2 when begin last 1k uploading
        - bandwidth drop after 7hr
          9551/10547 to 4kb
        - total 27hr, 100% success
          real	1623m22.216s
          user	5m15.172s
          sys	0m27.520s
        - only caculate MD5 10547
          real	0m23.656s
          user	0m43.596s
          sys	0m7.732s
        - 20369 files 1.7G upload 14hr 
          real	886m26.174s
          user	9m47.240s
          sys	0m52.852s